In [2]:
import pandas as pd

df = pd.read_excel("../data/raww_hr_analytics_data.xlsx")

In [3]:
df.head()

,employee_id,full_name,department,position,location,hire_date,termination_date,termination_reason,salary,age,gender,is_active
0,EMP0001,Nhân viên 1,HR,Manager,Đà Nẵng,2023-11-24,NaT,NaN,45054301,36,Nam,True
1,EMP0002,Nhân viên 2,Operations,Director,Hà Nội,2023-12-13,2024-05-02,Sa thải,82953410,49,Nam,False
2,EMP0003,Nhân viên 3,Finance,Manager,TP.HCM,2023-09-16,NaT,NaN,49006407,56,Nữ,True
3,EMP0004,Nhân viên 4,Sales,Manager,TP.HCM,2023-10-29,NaT,NaN,48856417,49,Nữ,True
4,EMP0005,Nhân viên 5,Customer Service,Junior,Hà Nội,2023-04-21,NaT,NaN,13778008,46,Nam,True

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   employee_id         500 non-null    object
 1   full_name           500 non-null    object
 2   department          500 non-null    object
 3   position            500 non-null    object
 4   location            500 non-null    object
 5   hire_date           500 non-null    datetime64[ns]
 6   termination_date    97 non-null     datetime64[ns]
 7   termination_reason  97 non-null     object
 8   salary              500 non-null    int64
 9   age                 500 non-null    int64
 10  gender              500 non-null    object
 11  is_active           500 non-null    bool
dtypes: bool(1), datetime64[ns](2), int64(2), object(7)
memory usage: 43.6+ KB

In [5]:
df.describe()

,hire_date,termination_date,salary,age
count,500,97,5.000000e+02,500.000000
mean,2023-07-12 04:53:45.600000,2024-04-23 17:04:19.793814528,3.384869e+07,40.428000
min,2023-01-01 00:00:00,2023-05-03 00:00:00,6.223725e+06,22.000000
25%,2023-04-20 00:00:00,2023-12-29 00:00:00,1.504156e+07,30.000000
50%,2023-07-11 12:00:00,2024-05-07 00:00:00,2.460086e+07,41.000000
75%,2023-10-10 00:00:00,2024-09-05 00:00:00,4.584411e+07,49.000000
max,2024-01-01 00:00:00,2024-12-22 00:00:00,8.497421e+07,60.000000
std,NaN,NaN,2.427017e+07,11.027421